org/memos/simple.org
#+OPTIONS: ^:{}
* card_display_simple

** 問題

      : % card_display heart 10 
      : > H0 	     # と表示される

      : % card_display spade 13 
      : > SK 	     # と表示される

      : % card_display diamond 1 
      : > DA 	     # と表示される

      : % card_display club 2
      : > C2           # と表示される


** 解プログラムの作成の流れ

*** simple_-1.c

**** やるべきこと

     - コマンドラインとのやり取りは一旦忘れる (後で)。
     - スーツと番号の文字列から表示用文字列を作る。
     - 表示用文字列を画面に表示する。

***** 部分的にプログラムを書いてみる:
      
     : str = card_string("heart", "10");
     : puts(str);

***** よさそうなので，コマンドラインから文字列もらうように書く 

#+BEGIN_SRC c
// 入力
suit_string = argv[1];
no_string = argv[2];
str = card_string(suit_string, no_string);
puts(str);
#+END_SRC

よさそう。

**** ~card_string~ 関数について考える

- ~card_string~ という名前をもった処理
- スーツと番号の文字列をもらって，
- 表示用文字列を作って返す

つまり, 下記の宣言となります:
#+BEGIN_SRC c
char *card_string(char *, char *);
#+END_SRC

**** ~card_string~ 関数を使うmainを書く

忘れないうちに，main関数を書いてみます:

#+BEGIN_SRC c :tangle simple_main.c
// simple.c#main()
# include <stdio.h>
# include <stdlib.h>
# include <string.h>

char * card_string(char *, char *);

int
main(int argc, char *argv[])
{
  char * suit_string = argv[1];
  char * no_string = argv[2];
  char * str = card_string(suit_string, no_string);
  puts(str);
  exit(0);
}
#+END_SRC     

よさそう。とりあえず，main 関数はこれで完成。

**** ~char *card_string(char *, char *)~ の入口出口ついて考える

入力引数の型と戻り値の型は既に決っているので，変数の名前を決めます:

- 最初の引数の名前は，~suit_string~ (札種を表す文字列の意)
- 最初の引数の名前は，~no_string~ (札番号を表す文字列の意)

ここまで決めると，card_stringの大枠ができます:
#+BEGIN_SRC c
char *card_string(char *suit_string, char *no_string)
{
  char *result;

  //  result = 変換(suit_string, no_string)
  result = "SA";

  return result;
}

#+END_SRC

**** simple_-1.c 

 simple0.c の要件を満しませんが，一応コンパイルして実行できるものがで
 きました。

#+BEGIN_SRC c :tangle simple_-1.c
// simple_-1.c
# include <stdio.h>
# include <stdlib.h>
# include <string.h>

char * card_string(char *, char *);

int
main(int argc, char *argv[])
{
  char * suit_string = argv[1];
  char * no_string = argv[2];
  char * str = card_string(suit_string, no_string);
  puts(str);
  exit(0);
}

char *card_string(char *suit_string, char *no_string)
{
  char *result;

  //  result = 変換(suit_string, no_string)
  result = "SA";

  return result;
}
 #+END_SRC

**** simple_-1.c をコンパイルする Makefile

#+BEGIN_SRC makefile :tangle Makefile_-1
# Makefile_-1
.PHONY: clean

simple_-1: simple_-1.c
	gcc -o $@ $^ 

clean:
	rm -f *~ \#* *.gch
#+END_SRC

- ~.PHONY:~ は，~clean~ がまぼろしのターゲットであることを定
  義しています。

- ~simple_-1~ ターゲットは，実行プログラム(ファイル)名で，
  - ~: simple_-1.c~ に依存していて，

  - ~simple_-1.c~ が ~simple_-1~ より新らしければ，

  - ~	gcc -o $@ $^ ~ が *シュルコマンド* として実行されます。

  - 実行の前に，~$@~ はターゲット(の名前)に，~$^~ はソースに置き換えら
    れ, 次のコマンドとなります:
    
    : gcc -o simple_-1 simple_-1.c

**** make
#+BEGIN_SRC sh :exports both
make -f Makefile_-1

#+END_SRC

#+RESULTS:
: gcc -o simple_-1 simple_-1.c

**** 実行

#+BEGIN_SRC sh :exports both
./simple_-1 "hoge" "hoge"

#+END_SRC

#+RESULTS:
: SA


*** simple_0.c
これから要件を満たすように変更していきましょう。

そのためには，card_string 関数を正しく作りなおせば良いでしょう。

そしてそのためには，
: result = "SA"; 

と書いていた部分を正しい処理に書き換えます。

#+BEGIN_SRC c
{ 
  char suit_c, no_c;
  char suit_char(char *);
  char no_char(char *);
  
  suit_c = suit_char(suit_string);
  no_c = no_char(no_string);
  result = (char *) malloc(3);
  result[0] = suit_c;
  result[1] = no_c;
  result[2] = '\0';
}
 
#+END_SRC

この中で，また，新しい関数を作ることになりました。

**** suit_char 関数

 #+BEGIN_SRC c
char suit_char(char *);
 #+END_SRC

 #+BEGIN_SRC c
char suit_char(char *suit)
{
  if (strcmp("spade", suit)) return 'S';
  if (strcmp("heart", suit)) return 'H';
  if (strcmp("diamond", suit)) return 'D';
  if (strcmp("club", suit)) return 'C';
  return('?');
} 
 #+END_SRC


**** no_char 関数
 #+BEGIN_SRC c
char no_char(char *);
 #+END_SRC

 #+BEGIN_SRC c
char no_char(char *no)
{
  int n = atoi(no);

  if (n==1) return 'A';
  if (n==13) return 'K';
  if (n==12) return 'Q';
  if (n==11) return 'J';
  if (n==10) return '0';
  return '0'+n;
}
 #+END_SRC


