org/org-docs/simple.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>初めてのcard_display_simple</title>
<!-- 2017-01-10 火 15:21 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Masayuki Suzuki" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://wiki.cis.iwate-u.ac.jp/~suzuki/org-html-theme/styles/sos/css/sos.css">
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">初めてのcard_display_simple</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. card_display/first</a>
<ul>
<li><a href="#sec-1-1">1.1. 問題</a></li>
<li><a href="#sec-1-2">1.2. 解プログラムの作成の流れ</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. simple_-1.c</a>
<ul>
<li><a href="#sec-1-2-1-1">1.2.1.1. やるべきこと</a>
<ul>
<li><a href="#sec-1-2-1-1-1">1.2.1.1.1. 部分的にプログラムを書いてみる:</a></li>
<li><a href="#sec-1-2-1-1-2">1.2.1.1.2. よさそうなので，コマンドラインから文字列もらうように書く</a></li>
</ul>
</li>
<li><a href="#sec-1-2-1-2">1.2.1.2. <code>card_string</code> 関数について考える</a></li>
<li><a href="#sec-1-2-1-3">1.2.1.3. <code>card_string</code> 関数を使うmainを書く</a></li>
<li><a href="#sec-1-2-1-4">1.2.1.4. <code>char *card_string(char *, char *)</code> の入口出口ついて考える</a></li>
<li><a href="#sec-1-2-1-5">1.2.1.5. simple_-1.c</a></li>
<li><a href="#sec-1-2-1-6">1.2.1.6. simple_-1.c をコンパイルする Makefile</a></li>
<li><a href="#sec-1-2-1-7">1.2.1.7. make</a></li>
<li><a href="#sec-1-2-1-8">1.2.1.8. 実行</a></li>
</ul>
</li>
<li><a href="#sec-1-2-2">1.2.2. simple_0.c</a>
<ul>
<li><a href="#sec-1-2-2-1">1.2.2.1. suit_char 関数</a></li>
<li><a href="#sec-1-2-2-2">1.2.2.2. no_char 関数</a></li>
<li><a href="#sec-1-2-2-3">1.2.2.3. simple_0.c</a></li>
<li><a href="#sec-1-2-2-4">1.2.2.4. make</a></li>
</ul>
</li>
<li><a href="#sec-1-2-3">1.2.3. card_string をテストするコード</a>
<ul>
<li><a href="#sec-1-2-3-1">1.2.3.1. make</a></li>
<li><a href="#sec-1-2-3-2">1.2.3.2. simple_0.1.c のまとめ</a></li>
</ul>
</li>
<li><a href="#sec-1-2-4">1.2.4. simple_1.c カードの作成</a>
<ul>
<li><a href="#sec-1-2-4-1">1.2.4.1. リファクタリング (プログラミング) - Wikipedia とは</a></li>
<li><a href="#sec-1-2-4-2">1.2.4.2. card_string関数のリファクタリング</a></li>
<li><a href="#sec-1-2-4-3">1.2.4.3. カード構造体を作る</a>
<ul>
<li><a href="#sec-1-2-4-3-1">1.2.4.3.1. 文字列で与えられたスーツ(文字列)を整数にする関数</a></li>
<li><a href="#sec-1-2-4-3-2">1.2.4.3.2. 番号文字列を数字にする関数</a></li>
</ul>
</li>
<li><a href="#sec-1-2-4-4">1.2.4.4. カードを文字列にする関数 card_to_string</a></li>
</ul>
</li>
<li><a href="#sec-1-2-5">1.2.5. simple_1.c</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> card_display/first</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 問題</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
% card_display heart 10 
&gt; H0         # と表示される
</pre>

<pre class="example">
% card_display spade 13 
&gt; SK         # と表示される
</pre>

<pre class="example">
% card_display diamond 1 
&gt; DA         # と表示される
</pre>

<pre class="example">
% card_display club 2
&gt; C2           # と表示される
</pre>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 解プログラムの作成の流れ</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> simple_-1.c</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><div id="outline-container-sec-1-2-1-1" class="outline-5">
<h5 id="sec-1-2-1-1"><span class="section-number-5">1.2.1.1</span> やるべきこと</h5>
<div class="outline-text-5" id="text-1-2-1-1">
<ul class="org-ul">
<li>コマンドラインとのやり取りは一旦忘れる (後で)。
</li>
<li>スーツと番号の文字列から表示用文字列を作る。
</li>
<li>表示用文字列を画面に表示する。
</li>
</ul>
</div>

<div id="outline-container-sec-1-2-1-1-1" class="outline-6">
<h6 id="sec-1-2-1-1-1"><span class="section-number-6">1.2.1.1.1</span> 部分的にプログラムを書いてみる:</h6>
<div class="outline-text-6" id="text-1-2-1-1-1">
<pre class="example">
str = card_string("heart", "10");
puts(str);
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-1-1-2" class="outline-6">
<h6 id="sec-1-2-1-1-2"><span class="section-number-6">1.2.1.1.2</span> よさそうなので，コマンドラインから文字列もらうように書く</h6>
<div class="outline-text-6" id="text-1-2-1-1-2">
<div class="org-src-container">

<pre class="src src-c">// 入力
suit_string = argv[1];
no_string = argv[2];
str = card_string(suit_string, no_string);
puts(str);
</pre>
</div>

<p>
よさそう。
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-1-2" class="outline-5">
<h5 id="sec-1-2-1-2"><span class="section-number-5">1.2.1.2</span> <code>card_string</code> 関数について考える</h5>
<div class="outline-text-5" id="text-1-2-1-2">
<ul class="org-ul">
<li><code>card_string</code> という名前をもった処理
</li>
<li>スーツと番号の文字列をもらって，
</li>
<li>表示用文字列を作って返す
</li>
</ul>

<p>
つまり, 下記の宣言となります:
</p>
<div class="org-src-container">

<pre class="src src-c">char *card_string(char *, char *);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-1-3" class="outline-5">
<h5 id="sec-1-2-1-3"><span class="section-number-5">1.2.1.3</span> <code>card_string</code> 関数を使うmainを書く</h5>
<div class="outline-text-5" id="text-1-2-1-3">
<p>
忘れないうちに，main関数を書いてみます:
</p>

<div class="org-src-container">

<pre class="src src-c">// simple.c#main()
# include &lt;stdio.h&gt;
# include &lt;stdlib.h&gt;
# include &lt;string.h&gt;

char * card_string(char *, char *);

int
main(int argc, char *argv[])
{
  char * suit_string = argv[1];
  char * no_string = argv[2];
  char * str = card_string(suit_string, no_string);
  puts(str);
  exit(0);
}
</pre>
</div>

<p>
よさそう。とりあえず，main 関数はこれで完成。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-1-4" class="outline-5">
<h5 id="sec-1-2-1-4"><span class="section-number-5">1.2.1.4</span> <code>char *card_string(char *, char *)</code> の入口出口ついて考える</h5>
<div class="outline-text-5" id="text-1-2-1-4">
<p>
入力引数の型と戻り値の型は既に決っているので，変数の名前を決めます:
</p>

<ul class="org-ul">
<li>最初の引数の名前は，~suit_string~ (札種を表す文字列の意)
</li>
<li>最初の引数の名前は，~no_string~ (札番号を表す文字列の意)
</li>
</ul>

<p>
ここまで決めると，card_stringの大枠ができます:
</p>
<div class="org-src-container">

<pre class="src src-c">char *card_string(char *suit_string, char *no_string)
{
  char *result;

  //  result = 変換(suit_string, no_string)
  result = "SA";

  return result;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-1-5" class="outline-5">
<h5 id="sec-1-2-1-5"><span class="section-number-5">1.2.1.5</span> simple_-1.c</h5>
<div class="outline-text-5" id="text-1-2-1-5">
<p>
simple0.c の要件を満しませんが，一応コンパイルして実行できるものがで
きました。
</p>

<div class="org-src-container">

<pre class="src src-c">// simple_-1.c
# include &lt;stdio.h&gt;
# include &lt;stdlib.h&gt;
# include &lt;string.h&gt;

char * card_string(char *, char *);

int
main(int argc, char *argv[])
{
  char * suit_string = argv[1];
  char * no_string = argv[2];
  char * str = card_string(suit_string, no_string);
  puts(str);
  exit(0);
}

char *card_string(char *suit_string, char *no_string)
{
  char *result;

  //  result = 変換(suit_string, no_string)
  result = "SA";

  return result;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-1-6" class="outline-5">
<h5 id="sec-1-2-1-6"><span class="section-number-5">1.2.1.6</span> simple_-1.c をコンパイルする Makefile</h5>
<div class="outline-text-5" id="text-1-2-1-6">
<div class="org-src-container">

<pre class="src src-makefile">.PHONY: clean

simple_-1: simple_-1.c
	gcc -o $@ $^ 

clean:
	rm -f *~ \#* *.gch
</pre>
</div>

<ul class="org-ul">
<li><code>.PHONY:</code> は，~clean~ がまぼろしのターゲットであることを定
義しています。
</li>

<li><code>simple_-1</code> ターゲットは，実行プログラム(ファイル)名で，
<ul class="org-ul">
<li><code>: simple_-1.c</code> に依存していて，
</li>

<li><code>simple_-1.c</code> が <code>simple_-1</code> より新らしければ，
</li>

<li>~        gcc -o $@ $^ ~ が <b>シュルコマンド</b> として実行されます。
</li>

<li>実行の前に，~$@~ はターゲット(の名前)に，~$^~ はソースに置き換えら
れ, 次のコマンドとなります:

<pre class="example">
gcc -o simple_-1 simple_-1.c
</pre>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-2-1-7" class="outline-5">
<h5 id="sec-1-2-1-7"><span class="section-number-5">1.2.1.7</span> make</h5>
<div class="outline-text-5" id="text-1-2-1-7">
<div class="org-src-container">

<pre class="src src-sh">make -f Makefile_-1
</pre>
</div>

<pre class="example">
gcc -o simple_-1 simple_-1.c
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-1-8" class="outline-5">
<h5 id="sec-1-2-1-8"><span class="section-number-5">1.2.1.8</span> 実行</h5>
<div class="outline-text-5" id="text-1-2-1-8">
<div class="org-src-container">

<pre class="src src-sh">./simple_-1 "hoge" "hoge"
</pre>
</div>

<pre class="example">
SA
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> simple_0.c</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
これから要件を満たすように変更していきましょう。
</p>

<p>
そのためには，card_string 関数を正しく作りなおせば良いでしょう。
</p>

<p>
そしてそのためには，
</p>
<pre class="example">
result = "SA"; 
</pre>

<p>
と書いていた部分を正しい処理に書き換えます。
</p>

<div class="org-src-container">

<pre class="src src-c">{ 
  char suit_c, no_c;
  char suit_char(char *);
  char no_char(char *);

  suit_c = suit_char(suit_string);
  no_c = no_char(no_string);
  result = (char *) malloc(3);
  result[0] = suit_c;
  result[1] = no_c;
  result[2] = '\0';
}
</pre>
</div>

<p>
この中で，また，新しい関数を作ることになりました。
</p>
</div>

<div id="outline-container-sec-1-2-2-1" class="outline-5">
<h5 id="sec-1-2-2-1"><span class="section-number-5">1.2.2.1</span> suit_char 関数</h5>
<div class="outline-text-5" id="text-1-2-2-1">
<div class="org-src-container">

<pre class="src src-c">char suit_char(char *);
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c">char suit_char(char *suit)
{
  if (strcmp("spade", suit)) return 'S';
  if (strcmp("heart", suit)) return 'H';
  if (strcmp("diamond", suit)) return 'D';
  if (strcmp("club", suit)) return 'C';
  return('?');
}
</pre>
</div>
</div>
</div>
