org/memos/simple.org
**** simple_0.c
 まとめると:

 #+BEGIN_SRC c :tangle simple_0.c
// simple_0.c
# include <stdio.h>
# include <stdlib.h>
# include <string.h>

char * card_string(char *, char *);

int
main(int argc, char *argv[])
{
  char * suit_string = argv[1];
  char * no_string = argv[2];
  char * str = card_string(suit_string, no_string);
  puts(str);
  exit(0);
}

char *card_string(char *suit_string, char *no_string)
{
  char *result;

  { 
    char suit_c, no_c;
    char suit_char(char *);
    char no_char(char *);
  
    suit_c = suit_char(suit_string);
    no_c = no_char(no_string);
    result = (char *) malloc(3);
    result[0] = suit_c;
    result[1] = no_c;
    result[2] = '\0';
  }

  return result;
}


char suit_char(char *suit)
{
  if (strcmp("spade", suit)==0) return 'S';
  if (strcmp("heart", suit)==0) return 'H';
  if (strcmp("diamond", suit)==0) return 'D';
  if (strcmp("club", suit)==0) return 'C';
  return('?');
} 

char no_char(char *no)
{
  int n = atoi(no);

  if (n==1) return 'A';
  if (n==13) return 'K';
  if (n==12) return 'Q';
  if (n==11) return 'J';
  if (n==10) return '0';
  return '0'+n;
}
 #+END_SRC

 Makefile は変更ありません:

#+BEGIN_SRC makefile :tangle Makefile_0
# Makefile_0
.PHONY: clean

simple_0: simple_0.c
	gcc -o $@ $^ 

clean:
	rm -f *~ \#* *.gch
 #+END_SRC

**** make
#+BEGIN_SRC sh :exports both
make -f Makefile_0

#+END_SRC

#+RESULTS:
: cc     simple_0.c   -o simple_0

#+BEGIN_SRC sh :exports both
./simple_0 heart 10
./simple_0 spade 1
./simple_0 diamond 13
./simple_0 club 2

#+END_SRC

#+RESULTS:
| H0 |
| SA |
| DK |
| C2 | 

simple_0.c 完成です。

*** card_string をテストするコード

card_string は関数で，満すべき性質は下記のように書くことができます:
#+BEGIN_SRC c 

if (strcmp(card_string("diamond", "1"), "DA")==0) puts("OK"); else puts("NG"); 
if (strcmp(card_string("spade", "13"), "SK")==0)  puts("OK"); else puts("NG"); 
if (strcmp(card_string("spade", "12"), "SQ")==0)  puts("OK"); else puts("NG"); 
if (strcmp(card_string("spade", "11"), "SJ")==0)  puts("OK"); else puts("NG"); 
if (strcmp(card_string("heart", "10"), "H0")==0)  puts("OK"); else puts("NG"); 
if (strcmp(card_string("club", "9"), "C9")==0) puts("OK"); else puts("NG"); 
if (strcmp(card_string("club", "2"), "C2")==0) puts("OK"); else puts("NG"); 
#+END_SRC

main関数の中で，card_string が呼ばれる前に，このテストを実行し，
card_string の実装が正しいことを，プログラム自身で確かめるようにしてみ
ます。


#+BEGIN_SRC c :tangle simple_0.1.c
// simple_0.1.c
# include <stdio.h>
# include <stdlib.h>
# include <string.h>

char * card_string(char *, char *);

int
main(int argc, char *argv[])
{
  char * suit_string = argv[1];
  char * no_string = argv[2];
  char * str;

  {
    void test_card_string(void);

    test_card_string();
  }

  str = card_string(suit_string, no_string);
  puts(str);
  exit(0);
}

void
test_card_string(void)
{
  if (strcmp(card_string("diamond", "1"), "DA")==0) puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "13"), "SK")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "12"), "SQ")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "11"), "SJ")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("heart", "10"), "H0")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("club", "9"), "C9")==0) puts("OK"); else puts("NG"); 
  if (strcmp(card_string("club", "2"), "C2")==0) puts("OK"); else puts("NG");
}

char *card_string(char *suit_string, char *no_string)
{
  char *result;

  { 
    char suit_c, no_c;
    char suit_char(char *);
    char no_char(char *);
  
    suit_c = suit_char(suit_string);
    no_c = no_char(no_string);
    result = (char *) malloc(3);
    result[0] = suit_c;
    result[1] = no_c;
    result[2] = '\0';
  }

  return result;
}

char suit_char(char *suit)
{
  if (strcmp("spade", suit)==0) return 'S';
  if (strcmp("heart", suit)==0) return 'H';
  if (strcmp("diamond", suit)==0) return 'D';
  if (strcmp("club", suit)==0) return 'C';
  return('?');
} 

char no_char(char *no)
{
  int n = atoi(no);

  if (n==1) return 'A';
  if (n==13) return 'K';
  if (n==12) return 'Q';
  if (n==11) return 'J';
  if (n==10) return '0';
  return '0'+n;
}
#+END_SRC

#+BEGIN_SRC makefile :tangle Makefile_0.1 :exports none
# Makefile_0.1
.PHONY: clean

simple_0.1: simple_0.1.c
	gcc -o $@ $^ 

clean:
	rm -f *~ \#* *.gch
 #+END_SRC

**** make
#+BEGIN_SRC sh :exports both
make -f Makefile_0.1
#+END_SRC

#+RESULTS:
: gcc -o simple_0.1 simple_0.1.c

#+BEGIN_SRC sh
./simple_0.1 heart 13

#+END_SRC

#+RESULTS:
| OK |
| OK |
| OK |
| OK |
| OK |
| OK |
| OK |
| HK |

OKですね。

**** simple_0.1.c のまとめ
次の関数を作った:
- ~char * card_string(char *suit_string, char *no_string);~ ::
     
- ~char suit_char(char *suit);~ ::
     
- ~char no_char(char *no);~ ::

- ~void test_card_string(void);~ ::
     

*** simple_1.c カードの作成

simple_0.1.c では，カードという *物* が現われていません。

今後，複数のカードの入力や，それらのソート機能が求められるため，
カードを作ることにします。

**** [[https://ja.wikipedia.org/wiki/%E3%83%AA%E3%83%95%E3%82%A1%E3%82%AF%E3%82%BF%E3%83%AA%E3%83%B3%E3%82%B0_(%E3%83%97%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%9F%E3%83%B3%E3%82%B0)][リファクタリング (プログラミング) - Wikipedia]] とは

#+BEGIN_QUOTE
リファクタリング (refactoring) とは、コンピュータプログラミングにおい
て、プログラムの外部から見た動作を変えずにソースコードの内部構造を整理
することである。
#+END_QUOTE

**** card_string関数のリファクタリング

     入力の suit_string と no_string から，表示文字列を作る前に，
     いったん一枚のカードを作ることにします。

     すると，カードを作る前と後の処理を別々に考えやすくなります。
     ~card_string~ 関数の処理の流れは次のようになります:

     - あるカード = カードの作成(suit_string, no_string)
       
       ~Card a_card = card_new_from_string(suit_string, no_string);~

     - result = カードの表示文字列を作る(あるカード)

       ~result = card_to_string(a_card);~

     カードを作るということは，カードの構造を持った構造体を作ることに
     なります。


