org/org-docs/simple.html


<div id="outline-container-sec-1-2-2-2" class="outline-5">
<h5 id="sec-1-2-2-2"><span class="section-number-5">1.2.2.2</span> no_char 関数</h5>
<div class="outline-text-5" id="text-1-2-2-2">
<div class="org-src-container">

<pre class="src src-c">char no_char(char *);
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c">char no_char(char *no)
{
  int n = atoi(no);

  if (n==1) return 'A';
  if (n==13) return 'K';
  if (n==12) return 'Q';
  if (n==11) return 'J';
  if (n==10) return '0';
  return '0'+n;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-2-3" class="outline-5">
<h5 id="sec-1-2-2-3"><span class="section-number-5">1.2.2.3</span> simple_0.c</h5>
<div class="outline-text-5" id="text-1-2-2-3">
<p>
まとめると:
</p>

<div class="org-src-container">

<pre class="src src-c">// simple_0.c
# include &lt;stdio.h&gt;
# include &lt;stdlib.h&gt;
# include &lt;string.h&gt;

char * card_string(char *, char *);

int
main(int argc, char *argv[])
{
  char * suit_string = argv[1];
  char * no_string = argv[2];
  char * str = card_string(suit_string, no_string);
  puts(str);
  exit(0);
}

char *card_string(char *suit_string, char *no_string)
{
  char *result;

  { 
    char suit_c, no_c;
    char suit_char(char *);
    char no_char(char *);

    suit_c = suit_char(suit_string);
    no_c = no_char(no_string);
    result = (char *) malloc(3);
    result[0] = suit_c;
    result[1] = no_c;
    result[2] = '\0';
  }

  return result;
}


char suit_char(char *suit)
{
  if (strcmp("spade", suit)==0) return 'S';
  if (strcmp("heart", suit)==0) return 'H';
  if (strcmp("diamond", suit)==0) return 'D';
  if (strcmp("club", suit)==0) return 'C';
  return('?');
} 

char no_char(char *no)
{
  int n = atoi(no);

  if (n==1) return 'A';
  if (n==13) return 'K';
  if (n==12) return 'Q';
  if (n==11) return 'J';
  if (n==10) return '0';
  return '0'+n;
}
</pre>
</div>

<p>
Makefile は変更ありません:
</p>

<div class="org-src-container">

<pre class="src src-makefile">.PHONY: clean

simple_0: simple_0.c
	gcc -o $@ $^ 

clean:
	rm -f *~ \#* *.gch
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-2-4" class="outline-5">
<h5 id="sec-1-2-2-4"><span class="section-number-5">1.2.2.4</span> make</h5>
<div class="outline-text-5" id="text-1-2-2-4">
<div class="org-src-container">

<pre class="src src-sh">make -f Makefile_0
</pre>
</div>

<pre class="example">
cc     simple_0.c   -o simple_0
</pre>

<div class="org-src-container">

<pre class="src src-sh">./simple_0 heart 10
./simple_0 spade 1
./simple_0 diamond 13
./simple_0 club 2
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">H0</td>
</tr>

<tr>
<td class="left">SA</td>
</tr>

<tr>
<td class="left">DK</td>
</tr>

<tr>
<td class="left">C2</td>
</tr>
</tbody>
</table>

<p>
simple_0.c 完成です。
</p>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> card_string をテストするコード</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
card_string は関数で，満すべき性質は下記のように書くことができます:
</p>
<div class="org-src-container">

<pre class="src src-c">if (strcmp(card_string("diamond", "1"), "DA")==0) puts("OK"); else puts("NG"); 
if (strcmp(card_string("spade", "13"), "SK")==0)  puts("OK"); else puts("NG"); 
if (strcmp(card_string("spade", "12"), "SQ")==0)  puts("OK"); else puts("NG"); 
if (strcmp(card_string("spade", "11"), "SJ")==0)  puts("OK"); else puts("NG"); 
if (strcmp(card_string("heart", "10"), "H0")==0)  puts("OK"); else puts("NG"); 
if (strcmp(card_string("club", "9"), "C9")==0) puts("OK"); else puts("NG"); 
if (strcmp(card_string("club", "2"), "C2")==0) puts("OK"); else puts("NG");
</pre>
</div>

<p>
main関数の中で，card_string が呼ばれる前に，このテストを実行し，
card_string の実装が正しいことを，プログラム自身で確かめるようにしてみ
ます。
</p>


<div class="org-src-container">

<pre class="src src-c">// simple_0.1.c
# include &lt;stdio.h&gt;
# include &lt;stdlib.h&gt;
# include &lt;string.h&gt;

char * card_string(char *, char *);

int
main(int argc, char *argv[])
{
  char * suit_string = argv[1];
  char * no_string = argv[2];
  char * str;

  {
    void test_card_string(void);

    test_card_string();
  }

  str = card_string(suit_string, no_string);
  puts(str);
  exit(0);
}

void
test_card_string(void)
{
  if (strcmp(card_string("diamond", "1"), "DA")==0) puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "13"), "SK")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "12"), "SQ")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "11"), "SJ")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("heart", "10"), "H0")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("club", "9"), "C9")==0) puts("OK"); else puts("NG"); 
  if (strcmp(card_string("club", "2"), "C2")==0) puts("OK"); else puts("NG");
}

char *card_string(char *suit_string, char *no_string)
{
  char *result;

  { 
    char suit_c, no_c;
    char suit_char(char *);
    char no_char(char *);

    suit_c = suit_char(suit_string);
    no_c = no_char(no_string);
    result = (char *) malloc(3);
    result[0] = suit_c;
    result[1] = no_c;
    result[2] = '\0';
  }

  return result;
}

char suit_char(char *suit)
{
  if (strcmp("spade", suit)==0) return 'S';
  if (strcmp("heart", suit)==0) return 'H';
  if (strcmp("diamond", suit)==0) return 'D';
  if (strcmp("club", suit)==0) return 'C';
  return('?');
} 

char no_char(char *no)
{
  int n = atoi(no);

  if (n==1) return 'A';
  if (n==13) return 'K';
  if (n==12) return 'Q';
  if (n==11) return 'J';
  if (n==10) return '0';
  return '0'+n;
}
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-3-1" class="outline-5">
<h5 id="sec-1-2-3-1"><span class="section-number-5">1.2.3.1</span> make</h5>
<div class="outline-text-5" id="text-1-2-3-1">
<div class="org-src-container">

<pre class="src src-sh">make -f Makefile_0.1
</pre>
</div>

<pre class="example">
gcc -o simple_0.1 simple_0.1.c
</pre>

<div class="org-src-container">

<pre class="src src-sh">./simple_0.1 heart 13
</pre>
</div>

<p>
OKですね。
</p>
</div>
</div>

<div id="outline-container-sec-1-2-3-2" class="outline-5">
<h5 id="sec-1-2-3-2"><span class="section-number-5">1.2.3.2</span> simple_0.1.c のまとめ</h5>
<div class="outline-text-5" id="text-1-2-3-2">
<p>
次の関数を作った:
</p>
<dl class="org-dl">
<dt> <code>char * card_string(char *suit_string, char *no_string);</code> </dt><dd>     
</dd>

<dt> <code>char suit_char(char *suit);</code> </dt><dd>     
</dd>

<dt> <code>char no_char(char *no);</code> </dt><dd>
</dd>

<dt> <code>void test_card_string(void);</code> </dt><dd></dd>
</dl>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> simple_1.c カードの作成</h4>
<div class="outline-text-4" id="text-1-2-4">
<p>
simple_0.1.c では，カードという <b>物</b> が現われていません。
</p>

<p>
今後，複数のカードの入力や，それらのソート機能が求められるため，
カードを作ることにします。
</p>
</div>

<div id="outline-container-sec-1-2-4-1" class="outline-5">
<h5 id="sec-1-2-4-1"><span class="section-number-5">1.2.4.1</span> <a href="https://ja.wikipedia.org/wiki/%E3%83%AA%E3%83%95%E3%82%A1%E3%82%AF%E3%82%BF%E3%83%AA%E3%83%B3%E3%82%B0_(%E3%83%97%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%9F%E3%83%B3%E3%82%B0)">リファクタリング (プログラミング) - Wikipedia</a> とは</h5>
<div class="outline-text-5" id="text-1-2-4-1">
<blockquote>
<p>
リファクタリング (refactoring) とは、コンピュータプログラミングにおい
て、プログラムの外部から見た動作を変えずにソースコードの内部構造を整理
することである。
</p>
</blockquote>
</div>
</div>

<div id="outline-container-sec-1-2-4-2" class="outline-5">
<h5 id="sec-1-2-4-2"><span class="section-number-5">1.2.4.2</span> card_string関数のリファクタリング</h5>
<div class="outline-text-5" id="text-1-2-4-2">
<p>
入力の suit_string と no_string から，表示文字列を作る前に，
いったん一枚のカードを作ることにします。
</p>

<p>
すると，カードを作る前と後の処理を別々に考えやすくなります。
<code>card_string</code> 関数の処理の流れは次のようになります:
</p>

<ul class="org-ul">
<li>あるカード = カードの作成(suit_string, no_string)

<p>
<code>Card a_card = card_new_from_string(suit_string, no_string);</code>
</p>
</li>

<li>result = カードの表示文字列を作る(あるカード)

<p>
<code>result = card_to_string(a_card);</code>
</p>
</li>
</ul>

<p>
カードを作るということは，カードの構造を持った構造体を作ることに
なります。
</p>
</div>
</div>
