org/memos/simple.org
**** カード構造体を作る

     取り敢えず，カードが持つ情報は次の2つとします:

     - スーツを表わす整数値
     - 番号を表わす整数値

     どちらも整数値としたのは，カードの強さを，数の大小関係で表わすた
     めです。

     スーツの整数値と番号の整数値をもつ構造体型に，_Cardと名前を付けて，
     定義します:

#+BEGIN_SRC c
struct _Card {
  int suit;
  int no;
};
#+END_SRC     

#+BEGIN_SRC c 
typdef struct _Card Card;
#+END_SRC     

カードを作るための関数を作ります。
また，~card_string~ で使うために，スーツや番号を表す文字列を与えてカー
ドを作る関数も併せて作ります。

#+BEGIN_SRC c
Card card_new(int suit, int no) 
{
  Card new;

  new.suit = suit;
  new.no = no;

  return new;
}

Card card_new_from_string(char *suit_str, char *no_str)
{
  int suit = card_suit_from_string(suit_str);
  int no = card_no_from_string(no_str);

  return card_new(suit, no);
}

 
#+END_SRC

ここで，~card_string~ がきちんと書けます:

#+BEGIN_SRC c
char *card_string(char *suit_string, char *no_string)
{
  char *result;

  {
    Card card_new_from_string(char *, char *);
    Card card;
    char *card_to_string(Card);

    card = card_new_from_string(suit_string, no_string);

    result = card_to_string(card);
  }

  return result;
}
#+END_SRC

***** 文字列で与えられたスーツ(文字列)を整数にする関数

~card_new_from_string~ 関数では次のように書きました:
      
#+BEGIN_SRC c
int suit = card_suit_from_string(suit_string);
#+END_SRC

~card_suit_from_string~ が満たすべきことをCで書いてみましょう:

#+BEGIN_SRC c

if (card_suit_from_string("spade") != 4) puts("error");
if (card_suit_from_string("heart") != 3) puts("error");
if (card_suit_from_string("diamond") != 2) puts("error");
if (card_suit_from_string("club") != 1) puts("error");

#+END_SRC

うまく使えそうです。これでいいでしょう。
すると，card_suit_from_string のプロトタイプ宣言が書けます:

 #+BEGIN_SRC c

int card_suit_from_string(char *);

 #+END_SRC

***** 番号文字列を数字にする関数

 続いて，カード番号について，プログラム内部表現への変換を，スーツ同様に，
 書いてみましょう:

 #+BEGIN_SRC c
int no =  card_no_from_string(no_str);
 #+END_SRC

~card_no_from_string~ が満たすべきことをCで書いてみましょう:
 #+BEGIN_SRC c

if (card_no_from_string("13") == 13 ) puts("OK"); else puts("NG");
if (card_no_from_string("12") == 12 ) puts("OK"); else puts("NG");
if (card_no_from_string("2") == 2 ) puts("OK"); else puts("NG");
if (card_no_from_string("1") == 14 ) puts("OK"); else puts("NG");

 #+END_SRC

**** カードを文字列にする関数 card_to_string
~card_to_string~ の使われかたは，次でした:
#+BEGIN_SRC c
str = card_to_string(card)
#+END_SRC

スーツと番号を表す数字をそれぞれ文字にする関数を考えます。

- ~card_suit_to_char(card)~
- ~card_no_to_string(card)~

すると，~card_to_string~ が書けます:
#+BEGIN_SRC c
char *
card_to_string(Card card)
{
char suit_char = card_suit_to_char(card);
char no_char = card_no_to_char(card);
char *result = (char *) malloc(3);

result[0] = suit_char;
result[1] = no_char;
result[2] = 0;

return result;
}

#+END_SRC


*** simple_1.c 

#+BEGIN_SRC c :tangle simple_1.c
// simple_1.c
# include <stdio.h>
# include <stdlib.h>
# include <string.h>

struct _Card {
  int suit;
  int no;
};

typedef struct _Card Card;

char *card_string(char *, char *);


Card card_new_from_string(char *, char *);
Card card_new(int, int);
int card_suit_from_string(char *);
int card_no_from_string(char *);

char *card_to_string(Card);
char card_suit_to_char(Card);
char card_no_to_char(Card);

int
main(int argc, char *argv[])
{
  char * suit_string = argv[1];
  char * no_string = argv[2];
  char * str;

  {
    void test_card_string(void);
    void test_card_suit_from_string(void);
    void test_card_no_from_string(void);

    test_card_suit_from_string();
    test_card_no_from_string();
    test_card_string();
  }

  str = card_string(suit_string, no_string);
  puts(str);

  exit(0);
}

void
test_card_string(void)
{
  if (strcmp(card_string("diamond", "1"), "DA")==0) puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "13"), "SK")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "12"), "SQ")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "11"), "SJ")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("heart", "10"), "H0")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("club", "9"), "C9")==0) puts("OK"); else puts("NG"); 
  if (strcmp(card_string("club", "2"), "C2")==0) puts("OK"); else puts("NG");
}


char *card_string(char *suit_string, char *no_string)
{
  char *result;

  {
    Card a = card_new_from_string(suit_string, no_string);
    
    result = card_to_string(a);
  }

  return result;
}

void
test_card_suit_from_string(void)
{
if (card_suit_from_string("spade") != 4) puts("error");
if (card_suit_from_string("heart") != 3) puts("error");
if (card_suit_from_string("diamond") != 2) puts("error");
if (card_suit_from_string("club") != 1) puts("error");
}

void
test_card_no_from_string(void)
{
  if (card_no_from_string("13") == 13 ) puts("OK"); else puts("NG");
  if (card_no_from_string("12") == 12 ) puts("OK"); else puts("NG");
  if (card_no_from_string("2") == 2 ) puts("OK"); else puts("NG");
  if (card_no_from_string("1") == 14 ) puts("OK"); else puts("NG");
}

Card card_new_from_string(char *suit_str, char *no_str)
{
  int suit = card_suit_from_string(suit_str);
  int no = card_no_from_string(no_str);

  return card_new(suit, no);
}


Card card_new(int suit, int no) 
{
  Card new;

  new.suit = suit;
  new.no = no;

  return new;
}

char *
card_to_string(Card card)
{
  char suitc = card_suit_to_char(card);
  char noc = card_no_to_char(card);
  char *result = (char *) malloc(3);

  result[0] = suitc;
  result[1] = noc;
  result[2] = 0;

  return result;
}

int 
card_suit_from_string(char *suit)
{
  if (strcmp("spade", suit)==0) return 4;
  if (strcmp("heart", suit)==0) return 3;
  if (strcmp("diamond", suit)==0) return 2;
  if (strcmp("club", suit)==0) return 1;
  return('?');
} 

# define SPADE 4
# define HEART 3
# define DIAMOND 2
# define CLUB 1

char
card_suit_to_char(Card c)
{
  if (c.suit==SPADE) return 'S';
  if (c.suit==HEART) return 'H';
  if (c.suit==DIAMOND) return 'D';
  if (c.suit==CLUB) return 'C';
  return('?');
} 

# define ACE 14
# define KING 13
# define QUEEN 12
# define JACK 11

int 
card_no_from_string(char *no)
{
  int n = atoi(no);

  if (n==1) n = ACE;
  return n;
}

char
card_no_to_char(Card c)
{
  int n = c.no;

  if (n==ACE) return 'A';
  if (n==KING) return 'K';
  if (n==QUEEN) return 'Q';
  if (n==JACK) return 'J';
  if (n==10) return '0';
  return '0'+n;
}

#+END_SRC

#+BEGIN_SRC makefile :tangle Makefile_1
# Makefile_1
.PHONY: clean

simple_1: simple_1.c
	gcc -o $@ $^ 

clean:
	rm -f *~ \#* *.gch
#+END_SRC

#+BEGIN_SRC sh :exports both :results output
make clean
make -f Makefile_1
./simple_1 heart 1
#+END_SRC

#+RESULTS:
#+begin_example
gcc -o simple_1 simple_1.c 
OK
OK
OK
OK
OK
OK
OK
OK
OK
OK
OK
HA
#+end_example

