org/org-docs/simple.html


<div id="outline-container-sec-1-2-4-3" class="outline-5">
<h5 id="sec-1-2-4-3"><span class="section-number-5">1.2.4.3</span> カード構造体を作る</h5>
<div class="outline-text-5" id="text-1-2-4-3">
<p>
取り敢えず，カードが持つ情報は次の2つとします:
</p>

<ul class="org-ul">
<li>スーツを表わす整数値
</li>
<li>番号を表わす整数値
</li>
</ul>

<p>
どちらも整数値としたのは，カードの強さを，数の大小関係で表わすた
めです。
</p>

<p>
スーツの整数値と番号の整数値をもつ構造体型に，_Cardと名前を付けて，
定義します:
</p>

<div class="org-src-container">

<pre class="src src-c">struct _Card {
  int suit;
  int no;
};
</pre>
</div>

<div class="org-src-container">

<pre class="src src-c">typdef struct _Card Card;
</pre>
</div>

<p>
カードを作るための関数を作ります。
また，~card_string~ で使うために，スーツや番号を表す文字列を与えてカー
ドを作る関数も併せて作ります。
</p>

<div class="org-src-container">

<pre class="src src-c">Card card_new(int suit, int no) 
{
  Card new;

  new.suit = suit;
  new.no = no;

  return new;
}

Card card_new_from_string(char *suit_str, char *no_str)
{
  int suit = card_suit_from_string(suit_str);
  int no = card_no_from_string(no_str);

  return card_new(suit, no);
}
</pre>
</div>

<p>
ここで，~card_string~ がきちんと書けます:
</p>

<div class="org-src-container">

<pre class="src src-c">char *card_string(char *suit_string, char *no_string)
{
  char *result;

  {
    Card card_new_from_string(char *, char *);
    Card card;
    char *card_to_string(Card);

    card = card_new_from_string(suit_string, no_string);

    result = card_to_string(card);
  }

  return result;
}
</pre>
</div>
</div>

<div id="outline-container-sec-1-2-4-3-1" class="outline-6">
<h6 id="sec-1-2-4-3-1"><span class="section-number-6">1.2.4.3.1</span> 文字列で与えられたスーツ(文字列)を整数にする関数</h6>
<div class="outline-text-6" id="text-1-2-4-3-1">
<p>
<code>card_new_from_string</code> 関数では次のように書きました:
</p>

<div class="org-src-container">

<pre class="src src-c">int suit = card_suit_from_string(suit_string);
</pre>
</div>

<p>
<code>card_suit_from_string</code> が満たすべきことをCで書いてみましょう:
</p>

<div class="org-src-container">

<pre class="src src-c">if (card_suit_from_string("spade") != 4) puts("error");
if (card_suit_from_string("heart") != 3) puts("error");
if (card_suit_from_string("diamond") != 2) puts("error");
if (card_suit_from_string("club") != 1) puts("error");
</pre>
</div>

<p>
うまく使えそうです。これでいいでしょう。
すると，card_suit_from_string のプロトタイプ宣言が書けます:
</p>

<div class="org-src-container">

<pre class="src src-c">int card_suit_from_string(char *);
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-4-3-2" class="outline-6">
<h6 id="sec-1-2-4-3-2"><span class="section-number-6">1.2.4.3.2</span> 番号文字列を数字にする関数</h6>
<div class="outline-text-6" id="text-1-2-4-3-2">
<p>
続いて，カード番号について，プログラム内部表現への変換を，スーツ同様に，
書いてみましょう:
</p>

<div class="org-src-container">

<pre class="src src-c">int no =  card_no_from_string(no_str);
</pre>
</div>

<p>
<code>card_no_from_string</code> が満たすべきことをCで書いてみましょう:
</p>
<div class="org-src-container">

<pre class="src src-c">if (card_no_from_string("13") == 13 ) puts("OK"); else puts("NG");
if (card_no_from_string("12") == 12 ) puts("OK"); else puts("NG");
if (card_no_from_string("2") == 2 ) puts("OK"); else puts("NG");
if (card_no_from_string("1") == 14 ) puts("OK"); else puts("NG");
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-2-4-4" class="outline-5">
<h5 id="sec-1-2-4-4"><span class="section-number-5">1.2.4.4</span> カードを文字列にする関数 card_to_string</h5>
<div class="outline-text-5" id="text-1-2-4-4">
<p>
<code>card_to_string</code> の使われかたは，次でした:
</p>
<div class="org-src-container">

<pre class="src src-c">str = card_to_string(card)
</pre>
</div>

<p>
スーツと番号を表す数字をそれぞれ文字にする関数を考えます。
</p>

<ul class="org-ul">
<li><code>card_suit_to_char(card)</code>
</li>
<li><code>card_no_to_string(card)</code>
</li>
</ul>

<p>
すると，~card_to_string~ が書けます:
</p>
<div class="org-src-container">

<pre class="src src-c">char *
card_to_string(Card card)
{
char suit_char = card_suit_to_char(card);
char no_char = card_no_to_char(card);
char *result = (char *) malloc(3);

result[0] = suit_char;
result[1] = no_char;
result[2] = 0;

return result;
}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> simple_1.c</h4>
<div class="outline-text-4" id="text-1-2-5">
<div class="org-src-container">

<pre class="src src-c">// simple_1.c
# include &lt;stdio.h&gt;
# include &lt;stdlib.h&gt;
# include &lt;string.h&gt;

struct _Card {
  int suit;
  int no;
};

typedef struct _Card Card;

char *card_string(char *, char *);


Card card_new_from_string(char *, char *);
Card card_new(int, int);
int card_suit_from_string(char *);
int card_no_from_string(char *);

char *card_to_string(Card);
char card_suit_to_char(Card);
char card_no_to_char(Card);

int
main(int argc, char *argv[])
{
  char * suit_string = argv[1];
  char * no_string = argv[2];
  char * str;

  {
    void test_card_string(void);
    void test_card_suit_from_string(void);
    void test_card_no_from_string(void);

    test_card_suit_from_string();
    test_card_no_from_string();
    test_card_string();
  }

  str = card_string(suit_string, no_string);
  puts(str);

  exit(0);
}

void
test_card_string(void)
{
  if (strcmp(card_string("diamond", "1"), "DA")==0) puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "13"), "SK")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "12"), "SQ")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("spade", "11"), "SJ")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("heart", "10"), "H0")==0)  puts("OK"); else puts("NG"); 
  if (strcmp(card_string("club", "9"), "C9")==0) puts("OK"); else puts("NG"); 
  if (strcmp(card_string("club", "2"), "C2")==0) puts("OK"); else puts("NG");
}


char *card_string(char *suit_string, char *no_string)
{
  char *result;

  {
    Card a = card_new_from_string(suit_string, no_string);

    result = card_to_string(a);
  }

  return result;
}

void
test_card_suit_from_string(void)
{
if (card_suit_from_string("spade") != 4) puts("error");
if (card_suit_from_string("heart") != 3) puts("error");
if (card_suit_from_string("diamond") != 2) puts("error");
if (card_suit_from_string("club") != 1) puts("error");
}

void
test_card_no_from_string(void)
{
  if (card_no_from_string("13") == 13 ) puts("OK"); else puts("NG");
  if (card_no_from_string("12") == 12 ) puts("OK"); else puts("NG");
  if (card_no_from_string("2") == 2 ) puts("OK"); else puts("NG");
  if (card_no_from_string("1") == 14 ) puts("OK"); else puts("NG");
}

Card card_new_from_string(char *suit_str, char *no_str)
{
  int suit = card_suit_from_string(suit_str);
  int no = card_no_from_string(no_str);

  return card_new(suit, no);
}


Card card_new(int suit, int no) 
{
  Card new;

  new.suit = suit;
  new.no = no;

  return new;
}

char *
card_to_string(Card card)
{
  char suitc = card_suit_to_char(card);
  char noc = card_no_to_char(card);
  char *result = (char *) malloc(3);


  result[0] = suitc;
  result[1] = noc;
  result[2] = 0;

  return result;
}

int 
card_suit_from_string(char *suit)
{
  if (strcmp("spade", suit)==0) return 4;
  if (strcmp("heart", suit)==0) return 3;
  if (strcmp("diamond", suit)==0) return 2;
  if (strcmp("club", suit)==0) return 1;
  return('?');
} 

# define SPADE 4
# define HEART 3
# define DIAMOND 2
# define CLUB 1

char
card_suit_to_char(Card c)
{
  if (c.suit==SPADE) return 'S';
  if (c.suit==HEART) return 'H';
  if (c.suit==DIAMOND) return 'D';
  if (c.suit==CLUB) return 'C';
  return('?');
} 

# define ACE 14
# define KING 13
# define QUEEN 12
# define JACK 11

int 
card_no_from_string(char *no)
{
  int n = atoi(no);

  if (n==1) n = ACE;
  return n;
}

char
card_no_to_char(Card c)
{
  int n = c.no;

  if (n==ACE) return 'A';
  if (n==KING) return 'K';
  if (n==QUEEN) return 'Q';
  if (n==JACK) return 'J';
  if (n==10) return '0';
  return '0'+n;
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-makefile">.PHONY: clean

simple_1: simple_1.c
	gcc -o $@ $^ 

clean:
	rm -f *~ \#* *.gch
</pre>
</div>

<div class="org-src-container">

<pre class="src src-sh">make clean
make -f Makefile_1
./simple_1 heart 1
</pre>
</div>

<pre class="example">
gcc -o simple_1 simple_1.c 
OK
OK
OK
OK
OK
OK
OK
OK
OK
OK
OK
HA
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Masayuki Suzuki</p>
<p class="date">Created: 2017-01-10 火 15:21</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
